In [118]:
import pandas as pd

In [119]:
df=pd.read_csv("C:\\Users\\kavya\\Downloads\\Dataset_1.csv")

In [120]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.5,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,1200,2023/03/10,Debit Card,NaN,5,yes
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,yes
3,ORD1003,user_3,35.0,1200,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,CARD,NaN,three,yes
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,3500.75,15/02/2023,upi,Mumbai,1,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,yes
997,NaN,user_997,50.0,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,65.0,1200,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

## 1) Identify all rows where order_amount is non-numeric but is_delivered is marked as delivered

In [121]:
m=pd.to_numeric(df['order_amount'], errors='coerce')
m

0       250.50
1      1200.00
2          NaN
3      1200.00
4      3500.75
        ...
995    3500.75
996        NaN
997        NaN
998    1200.00
999        NaN
Name: order_amount, Length: 1000, dtype: float64

In [156]:
m={"yes":"True"}
r=df["is_delivered"].replace(m,inplace=True)

In [123]:
df["is_delivered"]

0       True
1       True
2       True
3      False
4       True
       ...
995     True
996     True
997      NaN
998    False
999     True
Name: is_delivered, Length: 1000, dtype: object

In [124]:
df[(df["order_amount"].isna()) & (df["is_delivered"]=="True")]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,True
14,ORD1014,CUST14,25.0,NaN,2023/03/10,upi,DELHI,5,True
17,NaN,NaN,-3.0,NaN,15/02/2023,upi,Hyderabad,NaN,True
29,NaN,user_29,NaN,NaN,NaN,Debit Card,DELHI,7,True
38,NaN,CUST38,35.0,NaN,15/02/2023,CARD,NaN,1,True
...,...,...,...,...,...,...,...,...,...
970,ORD1970,NaN,18.0,NaN,NaN,Cash,Hyderabad,7,True
982,NaN,CUST982,25.0,NaN,15/02/2023,NaN,Bangalore,2,True
987,NaN,CUST987,50.0,NaN,2023/03/10,NaN,Bangalore,NaN,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,True
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

#### 2nd ans 
#### df["order_amount"]=pd.to_numeric(df["order_amount"],errors="coerce").isna() & \
#### df["is_delivered"]=df["is_delivered"].astype(str).str.lower().isin(["true","yes"])
#### df["mask"]

# 2) convert order_date to datetime and find orders where delivery_days is negative after valid date conversion.
### notna()- gives only valid values
### .value_counts()- gives the count of valid and invalid dates

In [125]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.5,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,1200,2023/03/10,Debit Card,NaN,5,True
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,True
3,ORD1003,user_3,35.0,1200,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,CARD,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,3500.75,15/02/2023,upi,Mumbai,1,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,50.0,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,65.0,1200,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

In [126]:
m=pd.to_datetime(df["order_date"],errors="coerce")#it directly converts into %d%m%y 'dayfirst=True'
m

0     2023-01-15
1            NaT
2            NaT
3     2023-01-15
4     2023-01-15
         ...
995          NaT
996   2023-01-15
997          NaT
998   2023-01-15
999          NaT
Name: order_date, Length: 1000, dtype: datetime64[ns]

In [127]:
r=pd.to_numeric(df['delivery_days'],errors='coerce').notna().value_counts()
r

delivery_days
True     703
False    297
Name: count, dtype: int64

In [128]:
df[df['delivery_days']<'0']

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
9,NaN,user_9,NaN,NaN,2023/03/10,UPI,Delhi,-1,no
11,NaN,CUST11,18.0,3500.75,NaN,Cash,Mumbai,-1,False
35,NaN,user_35,50.0,499.99,NaN,Cash,DELHI,-1,True
47,NaN,user_47,25.0,NaN,2023/03/10,Cash,Mumbai,-1,NaN
49,ORD1049,CUST49,120.0,3500.75,15/02/2023,NaN,Hyderabad,-1,False
...,...,...,...,...,...,...,...,...,...
936,ORD1936,user_936,NaN,NaN,15/02/2023,UPI,Bangalore,-1,no
937,ORD1937,CUST937,-3.0,NaN,2023-01-15,Debit Card,mumbai,-1,True
938,ORD1938,user_938,65.0,250.5,invalid,upi,mumbai,-1,NaN
945,ORD1945,NaN,NaN,250.5,2023-01-15,NaN,mumbai,-1,no
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

## 3) standandize payment_mode and calculate the percentage share of each mode per city

In [129]:
df['payment_mode']=df['payment_mode'].str.strip().str.lower().str.title()
df['city']=df['city'].str.strip().str.lower().str.title()

In [130]:
df['payment_mode']

0       Debit Card
1       Debit Card
2              NaN
3             Cash
4             Card
          ...
995            Upi
996    Credit Card
997           Cash
998            NaN
999     Debit Card
Name: payment_mode, Length: 1000, dtype: object

In [131]:
df['city']

0            NaN
1            NaN
2         Mumbai
3            NaN
4            NaN
         ...
995       Mumbai
996    Hyderabad
997        Delhi
998       Mumbai
999          NaN
Name: city, Length: 1000, dtype: object

In [132]:
df['payment_mode'].value_counts()

payment_mode
Upi            292
Cash           158
Card           151
Debit Card     141
Credit Card    123
Name: count, dtype: int64

In [133]:
df['city'].value_counts()

city
Delhi        302
Mumbai       264
Bangalore    151
Hyderabad    141
Name: count, dtype: int64

In [134]:
share=(df.groupby(['payment_mode','city']).size())
share

payment_mode  city
Card          Bangalore    25
              Delhi        48
              Hyderabad    23
              Mumbai       31
Cash          Bangalore    22
              Delhi        46
              Hyderabad    20
              Mumbai       44
Credit Card   Bangalore    15
              Delhi        41
              Hyderabad    18
              Mumbai       32
Debit Card    Bangalore    24
              Delhi        49
              Hyderabad    20
              Mumbai       36
Upi           Bangalore    42
              Delhi        89
              Hyderabad    36
              Mumbai       81
dtype: int64

In [135]:
percentage=share/share.groupby(level=0).sum() * 100
percentage

payment_mode  city
Card          Bangalore    19.685039
              Delhi        37.795276
              Hyderabad    18.110236
              Mumbai       24.409449
Cash          Bangalore    16.666667
              Delhi        34.848485
              Hyderabad    15.151515
              Mumbai       33.333333
Credit Card   Bangalore    14.150943
              Delhi        38.679245
              Hyderabad    16.981132
              Mumbai       30.188679
Debit Card    Bangalore    18.604651
              Delhi        37.984496
              Hyderabad    15.503876
              Mumbai       27.906977
Upi           Bangalore    16.935484
              Delhi        35.887097
              Hyderabad    14.516129
              Mumbai       32.661290
dtype: float64

In [136]:
percentage_df = pd.DataFrame(percentage).reset_index()
percentage_df

   payment_mode       city          0
0          Card  Bangalore  19.685039
1          Card      Delhi  37.795276
2          Card  Hyderabad  18.110236
3          Card     Mumbai  24.409449
4          Cash  Bangalore  16.666667
5          Cash      Delhi  34.848485
6          Cash  Hyderabad  15.151515
7          Cash     Mumbai  33.333333
8   Credit Card  Bangalore  14.150943
9   Credit Card      Delhi  38.679245
10  Credit Card  Hyderabad  16.981132
11  Credit Card     Mumbai  30.188679
12   Debit Card  Bangalore  18.604651
13   Debit Card      Delhi  37.984496
14   Debit Card  Hyderabad  15.503876
15   Debit Card     Mumbai  27.906977
16          Upi  Bangalore  16.935484
17          Upi      Delhi  35.887097
18          Upi  Hyderabad  14.516129
19          Upi     Mumbai  32.661290

In [150]:
percentage_df.rename(columns={0:'payment_order'})

   payment_mode       city  payment_order
0          Card  Bangalore      19.685039
1          Card      Delhi      37.795276
2          Card  Hyderabad      18.110236
3          Card     Mumbai      24.409449
4          Cash  Bangalore      16.666667
5          Cash      Delhi      34.848485
6          Cash  Hyderabad      15.151515
7          Cash     Mumbai      33.333333
8   Credit Card  Bangalore      14.150943
9   Credit Card      Delhi      38.679245
10  Credit Card  Hyderabad      16.981132
11  Credit Card     Mumbai      30.188679
12   Debit Card  Bangalore      18.604651
13   Debit Card      Delhi      37.984496
14   Debit Card  Hyderabad      15.503876
15   Debit Card     Mumbai      27.906977
16          Upi  Bangalore      16.935484
17          Upi      Delhi      35.887097
18          Upi  Hyderabad      14.516129
19          Upi     Mumbai      32.661290

## 4) Detect customers whose customer_age is invalid but have order_amounts above the datasets median

In [141]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.5,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,18.0,1200,2023/03/10,Debit Card,NaN,5,True
2,ORD1002,CUST2,35.0,NaN,NaN,NaN,Mumbai,7,True
3,ORD1003,user_3,35.0,1200,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,-3.0,3500.75,2023-01-15,Card,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,-3.0,3500.75,15/02/2023,Upi,Mumbai,1,True
996,NaN,CUST996,18.0,NaN,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,50.0,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,65.0,1200,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,120.0,NaN,15/02/2023,Debit Card,NaN,-1,True

In [153]:
df['customer_age']=pd.to_numeric(df['customer_age'],errors='coerce')
df['customer_age']

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
995   NaN
996   NaN
997   NaN
998   NaN
999   NaN
Name: customer_age, Length: 1000, dtype: float64

In [159]:
df['order_amount']=pd.to_numeric(df['order_amount'],errors='coerce')
df['order_amount']

0       250.50
1      1200.00
2          NaN
3      1200.00
4      3500.75
        ...
995    3500.75
996        NaN
997        NaN
998    1200.00
999        NaN
Name: order_amount, Length: 1000, dtype: float64

In [160]:
r=df['order_amount'].median()
r

499.99

In [161]:
df[(df['customer_age'].isna()) & (df['order_amount'] > r)]

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
1,ORD1001,NaN,NaN,1200.00,2023/03/10,Debit Card,NaN,5,True
3,ORD1003,user_3,NaN,1200.00,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,NaN,3500.75,2023-01-15,Card,NaN,three,True
5,NaN,NaN,NaN,1200.00,2023-01-15,Card,Mumbai,1,False
11,NaN,CUST11,NaN,3500.75,NaN,Cash,Mumbai,-1,False
...,...,...,...,...,...,...,...,...,...
989,ORD1989,NaN,NaN,1200.00,2023-01-15,Upi,Mumbai,three,no
991,NaN,NaN,NaN,3500.75,2023/03/10,Card,Hyderabad,1,True
993,NaN,NaN,NaN,3500.75,NaN,NaN,Hyderabad,2,True
995,NaN,user_995,NaN,3500.75,15/02/2023,Upi,Mumbai,1,True
998,ORD1998,NaN,NaN,1200.00,2023-01-15,NaN,Mumbai,2,False

## 5) find duplicate customer_ids where the same customer placed orders in multiple cities
 Question:Find customers who placed orders from more than one city?

In [162]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.50,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,NaN,1200.00,2023/03/10,Debit Card,NaN,5,True
2,ORD1002,CUST2,NaN,NaN,NaN,NaN,Mumbai,7,True
3,ORD1003,user_3,NaN,1200.00,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,NaN,3500.75,2023-01-15,Card,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,NaN,3500.75,15/02/2023,Upi,Mumbai,1,True
996,NaN,CUST996,NaN,NaN,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,NaN,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,NaN,1200.00,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,NaN,NaN,15/02/2023,Debit Card,NaN,-1,True

In [165]:
m=df.groupby('customer_id')['city'].nunique()
m

customer_id
CUST108     1
CUST11      1
CUST111     1
CUST117     1
CUST119     1
           ..
user_97     1
user_977    1
user_995    1
user_997    1
user_999    0
Name: city, Length: 489, dtype: int64

In [167]:
r=m[m>=1].reset_index()
r

    customer_id  city
0       CUST108     1
1        CUST11     1
2       CUST111     1
3       CUST117     1
4       CUST119     1
..          ...   ...
408    user_959     1
409     user_97     1
410    user_977     1
411    user_995     1
412    user_997     1

[413 rows x 2 columns]

# 6) Create a flag for orders where delivery_days is missing but is_delivered is True

In [168]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered
0,ORD1000,NaN,NaN,250.50,2023-01-15,Debit Card,NaN,5,True
1,ORD1001,NaN,NaN,1200.00,2023/03/10,Debit Card,NaN,5,True
2,ORD1002,CUST2,NaN,NaN,NaN,NaN,Mumbai,7,True
3,ORD1003,user_3,NaN,1200.00,2023-01-15,Cash,NaN,three,False
4,ORD1004,user_4,NaN,3500.75,2023-01-15,Card,NaN,three,True
...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,NaN,3500.75,15/02/2023,Upi,Mumbai,1,True
996,NaN,CUST996,NaN,NaN,2023-01-15,Credit Card,Hyderabad,2,True
997,NaN,user_997,NaN,NaN,2023/03/10,Cash,Delhi,1,NaN
998,ORD1998,NaN,NaN,1200.00,2023-01-15,NaN,Mumbai,2,False
999,NaN,user_999,NaN,NaN,15/02/2023,Debit Card,NaN,-1,True

In [183]:
df['missing_delivery_flag']=(df['delivery_days'].isna() & df['is_delivered']==True)
df['missing_delivery_flag'].value_counts()

missing_delivery_flag
False    882
True     118
Name: count, dtype: int64

In [184]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered,missing_delivery_flag
0,ORD1000,NaN,NaN,250.50,2023-01-15,Debit Card,NaN,5,True,False
1,ORD1001,NaN,NaN,1200.00,2023/03/10,Debit Card,NaN,5,True,False
2,ORD1002,CUST2,NaN,NaN,NaN,NaN,Mumbai,7,True,False
3,ORD1003,user_3,NaN,1200.00,2023-01-15,Cash,NaN,three,False,False
4,ORD1004,user_4,NaN,3500.75,2023-01-15,Card,NaN,three,True,False
...,...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,NaN,3500.75,15/02/2023,Upi,Mumbai,1,True,False
996,NaN,CUST996,NaN,NaN,2023-01-15,Credit Card,Hyderabad,2,True,False
997,NaN,user_997,NaN,NaN,2023/03/10,Cash,Delhi,1,NaN,False
998,ORD1998,NaN,NaN,1200.00,2023-01-15,NaN,Mumbai,2,False,False
999,NaN,user_999,NaN,NaN,15/02/2023,Debit Card,NaN,-1,True,False

# 7) After cleaning, compute the average order value per payment mode, excluding invalid amounts()

In [185]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered,missing_delivery_flag
0,ORD1000,NaN,NaN,250.50,2023-01-15,Debit Card,NaN,5,True,False
1,ORD1001,NaN,NaN,1200.00,2023/03/10,Debit Card,NaN,5,True,False
2,ORD1002,CUST2,NaN,NaN,NaN,NaN,Mumbai,7,True,False
3,ORD1003,user_3,NaN,1200.00,2023-01-15,Cash,NaN,three,False,False
4,ORD1004,user_4,NaN,3500.75,2023-01-15,Card,NaN,three,True,False
...,...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,NaN,3500.75,15/02/2023,Upi,Mumbai,1,True,False
996,NaN,CUST996,NaN,NaN,2023-01-15,Credit Card,Hyderabad,2,True,False
997,NaN,user_997,NaN,NaN,2023/03/10,Cash,Delhi,1,NaN,False
998,ORD1998,NaN,NaN,1200.00,2023-01-15,NaN,Mumbai,2,False,False
999,NaN,user_999,NaN,NaN,15/02/2023,Debit Card,NaN,-1,True,False

In [190]:
d=(df.groupby('payment_mode')['order_amount'].mean())
d

payment_mode
Card           1553.016237
Cash           1414.393708
Credit Card    1243.262656
Debit Card     1432.739318
Upi            1349.349091
Name: order_amount, dtype: float64

In [191]:
r=d.reset_index(name='avg_oder_amt')
r

  payment_mode  avg_oder_amt
0         Card   1553.016237
1         Cash   1414.393708
2  Credit Card   1243.262656
3   Debit Card   1432.739318
4          Upi   1349.349091

# 8) Identify cities where more than 30% of orders have missing order_date
Question- Find the cities where more than 30% of orders do not have an order_date

In [192]:
df

,order_id,customer_id,customer_age,order_amount,order_date,payment_mode,city,delivery_days,is_delivered,missing_delivery_flag,average_order
0,ORD1000,NaN,NaN,250.50,2023-01-15,Debit Card,NaN,5,True,False,NaN
1,ORD1001,NaN,NaN,1200.00,2023/03/10,Debit Card,NaN,5,True,False,NaN
2,ORD1002,CUST2,NaN,NaN,NaN,NaN,Mumbai,7,True,False,NaN
3,ORD1003,user_3,NaN,1200.00,2023-01-15,Cash,NaN,three,False,False,NaN
4,ORD1004,user_4,NaN,3500.75,2023-01-15,Card,NaN,three,True,False,NaN
...,...,...,...,...,...,...,...,...,...,...,...
995,NaN,user_995,NaN,3500.75,15/02/2023,Upi,Mumbai,1,True,False,NaN
996,NaN,CUST996,NaN,NaN,2023-01-15,Credit Card,Hyderabad,2,True,False,NaN
997,NaN,user_997,NaN,NaN,2023/03/10,Cash,Delhi,1,NaN,False,NaN
998,ORD1998,NaN,NaN,1200.00,2023-01-15,NaN,Mumbai,2,False,False,NaN
999,NaN,user_999,NaN,NaN,15/02/2023,Debit Card,NaN,-1,True,False,NaN

In [201]:
m=df['order_date'].isna().groupby(df['city']).mean().mul(100)

Series([], Name: order_date, dtype: float64)

In [198]:
dat=m.reset_index(name='missing_order_data')
dat

        city  missing_order_data
0  Bangalore           15.231788
1      Delhi           19.536424
2  Hyderabad           14.893617
3     Mumbai           19.318182